core/src/test/resources/wsdl/with_examples/order_api_examples/get_product.json

{
  "http-request": {
    "method": "POST",
    "path": "/",
    "headers": {
      "SOAPAction": "\"/orders/getProduct\"",
      "Content-Type": "text/xml"
    },
    "body": "<S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns0:Id xmlns:ns0=\"http://www.example.com/orders\"><id>123</id></ns0:Id></S:Body></S:Envelope>"
  },
  "http-response": {
    "status": 200,
    "headers": {
      "Content-Type": "text/xml"
    },
    "body": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Body><Product><name>Phone</name><type>Gadget</type><inventory>123</inventory><id>123</id></Product></SOAP-ENV:Body></SOAP-ENV:Envelope>"
  }
}
